SET @start_value = @@global.max_binlog_files;
SELECT @start_value;
@start_value
0
'#--------------------FN_DYNVARS_072_01------------------------#'
SET @@global.max_binlog_files = 5000;
SET @@global.max_binlog_files = DEFAULT;
SELECT @@global.max_binlog_files;
@@global.max_binlog_files
0
'#---------------------FN_DYNVARS_072_02-------------------------#'
SET @@global.max_binlog_files = @start_value;
SELECT @@global.max_binlog_files = 0;
@@global.max_binlog_files = 0
1
'#--------------------FN_DYNVARS_072_03------------------------#'
SET @@global.max_binlog_files = 4;
SELECT @@global.max_binlog_files;
@@global.max_binlog_files
4
SET @@global.max_binlog_files = 10;
SELECT @@global.max_binlog_files;
@@global.max_binlog_files
10
SET @@global.max_binlog_files = 10;
SELECT @@global.max_binlog_files;
@@global.max_binlog_files
10
SET @@global.max_binlog_files = 40;
SELECT @@global.max_binlog_files;
@@global.max_binlog_files
40
SET @@global.max_binlog_files = 65;
SELECT @@global.max_binlog_files;
@@global.max_binlog_files
65
'#--------------------FN_DYNVARS_072_04-------------------------#'
SET @@global.max_binlog_files = -1;
Warnings:
Warning	1292	Truncated incorrect max_binlog_files value: '-1'
SELECT @@global.max_binlog_files;
@@global.max_binlog_files
0
SET @@global.max_binlog_files = 100000000000;
Warnings:
Warning	1292	Truncated incorrect max_binlog_files value: '100000000000'
SELECT @@global.max_binlog_files;
@@global.max_binlog_files
102400
SET @@global.max_binlog_files = 10000.01;
ERROR 42000: Incorrect argument type to variable 'max_binlog_files'
SELECT @@global.max_binlog_files;
@@global.max_binlog_files
102400
SET @@global.max_binlog_files = -1024;
Warnings:
Warning	1292	Truncated incorrect max_binlog_files value: '-1024'
SELECT @@global.max_binlog_files;
@@global.max_binlog_files
0
SET @@global.max_binlog_files = 1024;
SELECT @@global.max_binlog_files;
@@global.max_binlog_files
1024
SET @@global.max_binlog_files = 4294967296;
Warnings:
Warning	1292	Truncated incorrect max_binlog_files value: '4294967296'
SELECT @@global.max_binlog_files;
@@global.max_binlog_files
102400
SET @@global.max_binlog_files = 4095;
SELECT @@global.max_binlog_files;
@@global.max_binlog_files
4095
SET @@global.max_binlog_files = ON;
ERROR 42000: Incorrect argument type to variable 'max_binlog_files'
SELECT @@global.max_binlog_files;
@@global.max_binlog_files
4095
SET @@global.max_binlog_files = 'test';
ERROR 42000: Incorrect argument type to variable 'max_binlog_files'
SELECT @@global.max_binlog_files;
@@global.max_binlog_files
4095
'#-------------------FN_DYNVARS_072_05----------------------------#'
SET @@session.max_binlog_files = 4096;
ERROR HY000: Variable 'max_binlog_files' is a GLOBAL variable and should be set with SET GLOBAL
SELECT @@session.max_binlog_files;
ERROR HY000: Variable 'max_binlog_files' is a GLOBAL variable
'#----------------------FN_DYNVARS_072_06------------------------#'
SELECT @@global.max_binlog_files = VARIABLE_VALUE 
FROM INFORMATION_SCHEMA.GLOBAL_VARIABLES 
WHERE VARIABLE_NAME='max_binlog_files';
@@global.max_binlog_files = VARIABLE_VALUE
1
SELECT @@max_binlog_files = VARIABLE_VALUE 
FROM INFORMATION_SCHEMA.SESSION_VARIABLES 
WHERE VARIABLE_NAME='max_binlog_files';
@@max_binlog_files = VARIABLE_VALUE
1
'#---------------------FN_DYNVARS_072_07----------------------#'
SET @@global.max_binlog_files = TRUE;
SELECT @@global.max_binlog_files;
@@global.max_binlog_files
1
SET @@global.max_binlog_files = FALSE;
SELECT @@global.max_binlog_files;
@@global.max_binlog_files
0
'#---------------------FN_DYNVARS_072_08----------------------#'
SET @@global.max_binlog_files = 5000;
SELECT @@max_binlog_files = @@global.max_binlog_files;
@@max_binlog_files = @@global.max_binlog_files
1
'#---------------------FN_DYNVARS_072_09----------------------#'
SET max_binlog_files = 6000;
ERROR HY000: Variable 'max_binlog_files' is a GLOBAL variable and should be set with SET GLOBAL
SELECT @@max_binlog_files;
@@max_binlog_files
5000
SET local.max_binlog_files = 7000;
ERROR 42000: You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'max_binlog_files = 7000' at line 1
SELECT local.max_binlog_files;
ERROR 42S02: Unknown table 'local' in field list
SET global.max_binlog_files = 8000;
ERROR 42000: You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'max_binlog_files = 8000' at line 1
SELECT global.max_binlog_files;
ERROR 42S02: Unknown table 'global' in field list
SELECT max_binlog_files = @@session.max_binlog_files;
ERROR 42S22: Unknown column 'max_binlog_files' in 'field list'
SET @@global.max_binlog_files = @start_value;
SELECT @@global.max_binlog_files;
@@global.max_binlog_files
0
